export interface Feedback {
  name: string;
  comment: string;
}

export const feedbacks: Feedback[] = [
  {
    name: 'Катерина',
    comment:
      'Дякую за професійну консультацію з приводу оформлення пенсії мамі-переселенцю. Доступно,чітко, все покроково розказали.',
  },
  {
    name: 'Анастасія',
    comment:
      'Всім дуже рекомендую адвоката Юлію Поддячу! Вона дуже професійна та приємна в спілкуванні, максимально зрозуміло все пояснила. Юлія провела швидку та якісну консультацію. Допомогла моїй мамі розібратися з періодами роботи та декрету та іншими нюансами, які впливають на стаж, та допомогла правильно їх зарахувати. Дуже їй вдячна, вона уважна, відповідальна та компетентна, тому раджу всім!',
  },
  {
    name: 'Лілія',
    comment:
      'Поддяча Юлія професійно надала консультацію з питання призначення пенсії моєму батькові. Розповіла про всі нюанси, проблемні моменти, та які документи потрібно дозбирати...З перших слів стало зрозуміло, що людина добре знає свою роботу, і має великий досвід в цій сфері.\nТому, з пенсійних питань однозначно рекомендую звертатися до Поддячої Юлії.',
  },
  {
    name: 'Володимир',
    comment:
      'Всім бажаю здоров\'я. Я на даний час військовослужбовець і в січні 2025 оформив пенсію в 55 років по УБД. Проте до загального стажу ПФ не врахував мені навчання денної форми в коледжі 2.8 років бо в Дипломі були неточності по періоду навчання. Для зарахування стажу потрібно було подати до ПФ Довідку з місця навчання з зазначенням періоду. Враховуючи ті обставини, що я перебуваю в ЗСУ, звернувся за допомогою до адвоката такої компанії "Адвокат Поддяча Юлія Юріївна". Інформацію про діяльність адвоката якісної і швидкої допомоги людям перед пенсійного та пенсійного віку по пенсійних справах знайшов в ютуб каналі. За поданням адвокатського запиту до мого навчального закладу за короткий час було отримано архівну Довідку і як позитивний результат: Довідку подано до ПФ , зараховано стаж, перераховано пенсію в +1124 грн. Результатом я звісно задоволений. Велике подяка Юлії Юрівні за проведену оперативну роботу по моїй справі та всім рекомендую не зволікати та звертатись до цього адвоката по пенсійним справам як до професіонала і фахівця своєї справи тому як "Час рікою тече..."',
  },
  {
    name: 'Ігор',
    comment:
      'Рекомендую адвоката Поддячу Юлію Юріївну! Звернувся до неї з питанням перевірки документів і оцифрування трудової книжки. Юлія Юріївна уважно перевірила всі документи, знайшла проблемні моменти, допомогла зібрати необхідні довідки та правильно подати оцифровані дані до Пенсійного фонду. У результаті мені зарахували всі періоди роботи та навчання. Дуже вдячний за професійну допомогу!',
  },
  {
    name: 'Микола',
    comment:
      "Дякую Юлії Юріївна у допомозі по виходу на пенсію як шахтарь. Після того як сходив у пенсійний, відразу зрозумів, що сам не доб'юся пенсії і там не допоможуть, а навпаки викидають, що хочуть із стажу. Мені не засчитали шахти де не було справок. Сподобалося, що всім процесом займалася особисто адвокат і перевірка документів, і подача в пенсійний, і суд, все контролювала, тримала в курсі, що там відбувається, шо зроблено. Оперативно все робила. Через суд мені пенсію призначили, завдяки професійній допомозі адвоката. Вже отримав першу пенсію. Тому я дуже вдячний Поддячій Юлії Юріївні!",
  },
  {
    name: 'Ольга',
    comment:
      'Звернулась до пенсійного адвоката - Поддячої Юлії за консультацією і залишилася дуже задоволена результатом. Вона уважно перевірила всі мої документи, допомогла правильно порахувати стаж і пояснила, коли краще подавати документи на призначення пенсії, так як мій день народження в кінці року, щоб не втратити у виплатах. Окремо хочу подякувати за допомогу зі збором документів для пенсії, допомогла отримати витяг про підтвердження дошлюбного прізвища, а також оцифрувати трудову книжку. Усі пояснення були зрозумілі, завжди була на зв’язку та відповідала на запитання. Завдяки її допомозі процес призначення пенсії пройшов спокійно й без зайвих хвилювань. Рекомендую як фахівця, який дійсно розбирається в пенсійних питаннях.',
  },
  {
    name: 'Таня Щербак',
    comment:
      'Доброго дня. Мала луже для мкне хвилююче питания. Пані Юлія, добре , а для мене головне ЗРОЗУМІЛОЮ МОВОЮ пояснила, дала поради. Дуже вдячна їй.',
  },
  {
    name: 'Андрій Коновал',
    comment:
      'Якщо Пенсійний фонд надіслав вам відмову — не гайте часу і звертайтеся до адвоката Поддячої. Юлія Юріївна допомогла мені оскаржити неправомірне рішення в судовому порядку. Вона чітко бачить слабкі місця в аргументації чиновників і знає, як захистити права пенсіонера. Дуже грамотний тактик і стратег у пенсійних справах!',
  },
  {
    name: 'Родіон Хабіров',
    comment:
      'Хочу висловити щиру вдячність адвокату Поддячій Юлії Юріївні за високу професійну допомогу у вирішенні мого пенсійного питання. Юлія Юріївна - справжній фахівець, який досконало знає всі тонкощі пенсійного законодавства. Завдяки її чітким діям та грамотно підготовленим документам вдалося досягти позитивного результату (перерахунку пенсії), на який я вже майже не сподівався. Рекомендую як надійного та відповідального захисника!',
  },
  {
    name: 'Володимир Цвентух',
    comment: `Юлія Юріївна — не просто професійний адвокат, а людина, яка справді вболіває за результат свого клієнта. Звернувся до неї зі складною проблемою щодо пенсійного стажу. Юлія Юріївна дуже терпляче і доступно пояснила всі юридичні моменти, завжди була на зв'язку та підтримувала на кожному етапі. Дуже приємно мати справу з такою чуйною та компетентною людиною. Дякую за вашу працю!`,
  },
  {
    name: 'Юлія Жигир',
    comment: `Щира подяка адвокату Юлії Юріївні за допомогу в нашій пенсійній справі.Ваша професійність, розуміння ситуації та невтомне старання заслуговують на найвищу похвалу.Ви справжній професіонал своєї справи.Рекомендую Юлію Юріївна як надійного, відповідального та компетентного адвоката.`,
  },
  {
    name: 'Оксана Крутиліна',
    comment: `Зверталася до адвоката Поддячої Юлії Юріївни за перевіркою пенсійних документів та допомогою з їх оцифруванням. Усе було виконано професійно, оперативно та з увагою до деталей. Дякую за якісну роботу та рекомендую як фахового адвоката у пенсійних питаннях!`,
  },
  {
    name: 'Алла Іванова',
    comment: `Професійно, швидко. Рекомендую🤝`,
  },
  {
    name: 'Оксана',
    comment: `Отримала чітку відповідь на своє запитання. Це помогло мені визначитись с подальшими діямі. Дякую Юлії Юріївні`,
  },
  {
    name: 'Наталія Адамович',
    comment: `Отримувала у Юлії консультацію стосовно пенсійного права. Юлія прекрасний спеціаліст, чудово володіє нормами законодавства та судовою практикою. Рекомендую!`,
  },
  {
    name: 'Серж Карец',
    comment: `Я дуже задоволений виконаною роботою Юлії Юріївни. Я вражений її професіоналізмом і наполегливістю у вирішенні мого питання, які призвели до бажаного результату. Я готовий рекомендувати цього фахівця всім, хто потребує допомоги.`,
  },
  {
    name: 'Александр Семко',
    comment: `Грамотний фахівець у своїй сфері. Зверталися за допомогою, про нарахування підвищеної пенсії для дідуся. Юлія все зробила швидко та грамотно. Розглянула всі папери, які ми назбирали щодо місць, де працював дідусь. Сказала які ще потрібно документи .. і все це в найкоротші строки, бо ми з сестрою попросили, адже треба було подавати на суд всі папери. Справу вела до кінця, за що окреме дякую цій дівчині...
Ціна за послуги, навіть нижче середньої... . Що також радує...
Дякую вам Юлія! Якщо будуть прецеденти, ми обов'язково звернемося до вас...`,
  },
];
